In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

In [22]:
data = pd.read_csv('bi.csv',encoding='latin1')
data.head()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,NaN,44
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80

In [23]:
#Data Cleaning
#checking the missing values
data.isnull().sum() #gives the sum of null values in each col

fNAME            0
lNAME            0
Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           2
DB               0
dtype: int64

In [24]:
#since there are less null values we can drop those rows
df = data.dropna()

In [25]:
df.isnull().sum()

fNAME            0
lNAME            0
Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           0
DB               0
dtype: int64

In [26]:
#to get the datatype of each col
df.info() #df.dtypes

<class 'pandas.core.frame.DataFrame'>
Index: 75 entries, 0 to 76
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   fNAME          75 non-null     object
 1   lNAME          75 non-null     object
 2   Age            75 non-null     int64
 3   gender         75 non-null     object
 4   country        75 non-null     object
 5   residence      75 non-null     object
 6   entryEXAM      75 non-null     int64
 7   prevEducation  75 non-null     object
 8   studyHOURS     75 non-null     int64
 9   Python         75 non-null     float64
 10  DB             75 non-null     int64
dtypes: float64(1), int64(4), object(6)
memory usage: 7.0+ KB

In [27]:
#to check if there are any duplicate rows in a col
df.duplicated().sum()

np.int64(0)

In [28]:
df.head()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80
5,Hannah,Hansen,25,female,Norge,BI Residence,66,High School,130,88.0,59

In [29]:
#Handling inconsistency in Gender col
df['gender'].value_counts()

gender
Female    41
Male      31
M          1
female     1
male       1
Name: count, dtype: int64

In [30]:
#Normalizing the gender col
df['gender']=(df['gender'].astype(str).str.strip().str.lower())

gender_map={'M':'male',
           'male':'male',
           'female':'female'}
df['gender']=df['gender'].map(gender_map)
df['gender'].value_counts()

gender
female    42
male      32
Name: count, dtype: int64

In [31]:
#Handling inconsistency in country col
df.country.value_counts()

country
Norway          46
Uganda           4
Kenya            3
Germany          3
Denmark          2
Netherlands      2
Spain            2
UK               2
Somali           2
Nigeria          2
Italy            2
France           2
norway           1
South Africa     1
Norge            1
Name: count, dtype: int64

In [34]:
#Normalize and map
df['country']=(df['country'].astype(str).str.strip().str.lower()) #strip only removes the front and back spaces
df['country'] = df['country'].str.title()
df['country']=df['country'].replace({'Norge':'Norway','Somali':'Somalia'})
df['country'].value_counts()

country
Norway          48
Uganda           4
Kenya            3
Germany          3
Denmark          2
Uk               2
Netherlands      2
Spain            2
Italy            2
Nigeria          2
Somalia          2
France           2
South Africa     1
Name: count, dtype: int64

In [35]:
#Handling inconsistensies in prevEducation col
df['prevEducation'].value_counts()

prevEducation
Bachelors       24
Masters         16
High School     16
Diploma          9
Doctorate        5
HighSchool       1
Barrrchelors     1
diploma          1
DIPLOMA          1
Diplomaaa        1
Name: count, dtype: int64

In [36]:
#Normalize and replace
df['prevEducation']=(df['prevEducation'].astype(str).str.strip().str.lower())
df['prevEducation']=df['prevEducation'].str.title()
df['prevEducation'].value_counts()

prevEducation
Bachelors       24
Masters         16
High School     16
Diploma         11
Doctorate        5
Highschool       1
Barrrchelors     1
Diplomaaa        1
Name: count, dtype: int64

In [38]:
df['prevEducation']=df['prevEducation'].replace({'Diplomaaa':'Diploma',
                                                'Highschool' : 'High School',
                                                'Barrrchelors' :'Bachelors'})
df['prevEducation'].value_counts()

prevEducation
Bachelors      25
High School    17
Masters        16
Diploma        12
Doctorate       5
Name: count, dtype: int64